recipes/baked-vegan-cheesecake.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Baked Vegan Cheesecake</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />

<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Baked Vegan Cheesecake</h1>
<p>
<a href="https://www.frei-style.com/en/the-perfect-vegan-cheesecake-with-silken-tofu">Original link</a>
</p>

<div id="outline-container-org30ecd54" class="outline-2">
<h2 id="org30ecd54">Ingredients</h2>
<div class="outline-text-2" id="text-org30ecd54">
</div>
<div id="outline-container-org516e003" class="outline-3">
<h3 id="org516e003">Cake base</h3>
<div class="outline-text-3" id="text-org516e003">
<ul class="org-ul">
<li>260 gr 2 cups flour</li>
<li>80 gr 1/3 cup sugar (i.e. cane sugar)</li>
<li>2 tsp baking powder</li>
<li>1 Tbsp soy flour</li>
<li>140 gr vegan butter /margarine</li>
</ul>
</div>
</div>

<div id="outline-container-org8f30bec" class="outline-3">
<h3 id="org8f30bec">Cheese cream</h3>
<div class="outline-text-3" id="text-org8f30bec">
<ul class="org-ul">
<li>800 gr 28 oz. Taifun silken tofu</li>
<li>150 gr 3/4 cup cane sugar</li>
<li>60-70 gr 1/2 cup starch</li>
<li>Pulp of 2-3 vanilla beans or 4 tsp vanilla extract</li>
<li>Zest of 1 organic lemon</li>
<li>Juice of 1 lemon</li>
<li>70 ml 1/3 cup canola oil</li>
<li>2 Tbsp soy flour</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org975617c" class="outline-2">
<h2 id="org975617c">Instructions</h2>
<div class="outline-text-2" id="text-org975617c">
</div>
<div id="outline-container-orgbac8b5a" class="outline-3">
<h3 id="orgbac8b5a">Cake base:</h3>
<div class="outline-text-3" id="text-orgbac8b5a">
<ol class="org-ol">
<li>Mix flour, sugar, baking powder and soy flour</li>
<li>Add cold butter/margarine</li>
<li>Knead into a smooth dough – wrap it in foil and place it in fridge for approx. 30 minutes</li>
</ol>
</div>
</div>

<div id="outline-container-org1737aca" class="outline-3">
<h3 id="org1737aca">Cheese cream</h3>
<div class="outline-text-3" id="text-org1737aca">
<ol class="org-ol">
<li>Add the silken tofu along with all other ingredients into a mixer/food processor and mix on high level until the mixture is smooth, there shouldn’t be any chunks left</li>
<li>The more starch you use, the more solid the cheese cream gets</li>
</ol>
</div>
</div>

<div id="outline-container-orgf9dedeb" class="outline-3">
<h3 id="orgf9dedeb">Bake</h3>
<div class="outline-text-3" id="text-orgf9dedeb">
<ol class="org-ol">
<li>Preheat the oven to 180°C</li>
<li>Take the cake base out of the fridge</li>
<li>Either grease a large springform pan ø 26 cm (10”) or two small ones ø 18 cm (7“) or line them with baking paper</li>
<li>Put the dough into the pan and press it down firmly as well as 2/3 from the sides</li>
<li>Put the cheese cream onto it</li>
<li>Bake the small pans for approx. 30-40 minutes, the large one for approx. 45-55 minutes</li>
<li>If you bake the golden drop cake with meringue, put the meringue onto the cake for the last 20 minutes and bake it</li>
<li>Let the cake cool off and take the cake out of the pan</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
